export const data = [
    {
        question:'源程序是如何保存在计算机中的?',
        answer:'我们编写源程序时，使用`abcd{}...`这一类字符，并没有直接保存在计算机中，这些字符会被转换成不同字节保存在计算机中',
        score:1
    },
    {
        question:'什么是字节？',
        answer:'8个位被组织成一组被称作字节，一字节是8位模式，或者说8位比特序列',
        score:1
    },
    {
        question:'什么是位模式？',
        answer:'多个位组成的比特序列就是位模式，有x位便称为x位模式，比如一字节有8个位，字节就是8位模式',
        score:1
    },
    {
        question:'什么是比特【位】？',
        answer:'位就是0或1',
        score:1
    },
    {
        
    }
]
